
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПакетДокументов(ПараметрыВыполнения) Экспорт
	
	Результат = Новый Массив;
	Если ПараметрыВыполнения.ИдентификаторКоманды = "СоздатьПакетДокументов" Тогда
		
		ПроцентВыполнения  = 0;
		СообщениеПрогресса = СтрШаблон("Начало загрузки документов");
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, СообщениеПрогресса);
		
		Пауза();
		
		//Для Сч = 1 По 1000 Цикл
		Результат.Добавить(1);
		ПроцентВыполнения= 50;
		//ПроцентВыполнения  = (Сч/1000)*100;
		СообщениеПрогресса = СтрШаблон("Продолжение загрузки документов");
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, СообщениеПрогресса);
		
		Пауза();
		
		//КонецЦикла;
		
		ПроцентВыполнения  = 100;
		СообщениеПрогресса = СтрШаблон("Окончание загрузки документов");
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, СообщениеПрогресса);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Пауза()
	
	ПятьСекунд = ТекущаяДатаСеанса() + 5;
	
	Пока ТекущаяДатаСеанса() < ПятьСекунд Цикл
		// Имитация задержки
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли