
&НаКлиенте
Процедура УстановитьНастройки(Команда)
	
	СохранитьЗначения();
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Настройки = ОбработкаОбъект.ПолученныеНастройки();
	Если Настройки <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки);
	Иначе
		ЗначенияПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗначенияПоУмолчанию()
	
	НачалоСтрокиЧтения = 1;
	КолонкаАртикул = 1;
	КолонкаНоменклатура = 2;
	КолонкаКоличествоФакт = 3;
	
КонецПроцедуры

&НаСервере
Функция Настройки()
	
	Настройки = Новый Структура;
	Настройки.Вставить("НачалоСтрокиЧтения", НачалоСтрокиЧтения);
	Настройки.Вставить("КолонкаАртикул", КолонкаАртикул);
	Настройки.Вставить("КолонкаНоменклатура", КолонкаНоменклатура);
	Настройки.Вставить("КолонкаКоличествоФакт", КолонкаКоличествоФакт);
	
	Возврат Настройки;
	
КонецФункции

&НаСервере
Процедура СохранитьЗначения()
	
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	ИмяПользователя = "";
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ИмяПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "Наименование");
	КонецЕсли;

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Ключ = ОбработкаОбъект.КлючОбъекта();
	
	Настройки = Настройки();
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(Ключ,, Настройки,, ИмяПользователя);
	
КонецПроцедуры
