
#Область СлужебныеПроцедурыИФункции

Функция ПолученныеНастройки() Экспорт
	
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	ИмяПользователя = "";
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ИмяПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "Наименование");
	КонецЕсли;
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючОбъекта(),,,, ИмяПользователя);
	
	Возврат Настройки;
	
КонецФункции

Функция КлючОбъекта() Экспорт
	
	Возврат ЭтотОбъект.Метаданные().Имя;
	
КонецФункции

#КонецОбласти
