
&НаСервере
Процедура IT_Okna_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Попытка
		Список.ТекстЗапроса = ТекстЗапросаСписка();
		
		НовыйЭлемент  = Элементы.Добавить("СписокЗаказ", Тип("ПолеФормы"), Элементы.Список);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
		НовыйЭлемент.ПутьКДанным = "Список.Заказ";
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекстЗапросаСписка()
	
	Возврат "ВЫБРАТЬ
	        |	ПроизводствоБезЗаказа.Ссылка КАК Ссылка,
	        |	ПроизводствоБезЗаказа.ПометкаУдаления КАК ПометкаУдаления,
	        |	ПроизводствоБезЗаказа.Номер КАК Номер,
	        |	ПроизводствоБезЗаказа.Дата КАК Дата,
	        |	ПроизводствоБезЗаказа.Проведен КАК Проведен,
	        |	ПроизводствоБезЗаказа.Организация КАК Организация,
	        |	ПроизводствоБезЗаказа.Подразделение КАК Подразделение,
	        |	ПроизводствоБезЗаказа.ГруппировкаЗатрат КАК ГруппировкаЗатрат,
	        |	ПроизводствоБезЗаказа.ВыпускПодДеятельность КАК ВыпускПодДеятельность,
	        |	ПроизводствоБезЗаказа.НаправлениеДеятельности КАК НаправлениеДеятельности,
	        |	ПроизводствоБезЗаказа.ВидЦены КАК ВидЦены,
	        |	ПроизводствоБезЗаказа.Ответственный КАК Ответственный,
	        |	ПроизводствоБезЗаказа.Комментарий КАК Комментарий,
	        |	ПроизводствоБезЗаказа.ВидыЗапасовУказаныВручную КАК ВидыЗапасовУказаныВручную,
	        |	ПроизводствоБезЗаказа.Валюта КАК Валюта,
	        |	ПроизводствоБезЗаказа.ЕстьМаркируемаяПродукцияГИСМ КАК ЕстьМаркируемаяПродукцияГИСМ,
	        |	ПроизводствоБезЗаказа.РаспоряжениеДляТрудозатрат КАК РаспоряжениеДляТрудозатрат,
	        |	ПроизводствоБезЗаказа.МаксимальныйКодСтрокиВыходныеИзделия КАК МаксимальныйКодСтрокиВыходныеИзделия,
	        |	ПроизводствоБезЗаказа.МаксимальныйКодСтрокиТрудозатраты КАК МаксимальныйКодСтрокиТрудозатраты,
	        |	ПроизводствоБезЗаказа.СпособРаспределенияЗатратНаВыходныеИзделия КАК СпособРаспределенияЗатратНаВыходныеИзделия,
	        |	ПроизводствоБезЗаказа.ВыходныеИзделия.(
	        |		Ссылка КАК Ссылка,
	        |		НомерСтроки КАК НомерСтроки,
	        |		НаправлениеВыпуска КАК НаправлениеВыпуска,
	        |		СтатусУказанияСерий КАК СтатусУказанияСерий,
	        |		Характеристика КАК Характеристика,
	        |		Получатель КАК Получатель,
	        |		Количество КАК Количество,
	        |		Упаковка КАК Упаковка,
	        |		Цена КАК Цена,
	        |		Сумма КАК Сумма,
	        |		Спецификация КАК Спецификация,
	        |		Назначение КАК Назначение,
	        |		ДоляСтоимости КАК ДоляСтоимости,
	        |		ДоляСтоимостиНаЕдиницу КАК ДоляСтоимостиНаЕдиницу,
	        |		Подразделение КАК Подразделение,
	        |		АналитикаРасходов КАК АналитикаРасходов,
	        |		АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	        |		АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	        |		НастройкаСчетовУчета КАК НастройкаСчетовУчета,
	        |		ОформитьОтчетДавальцу КАК ОформитьОтчетДавальцу,
	        |		Номенклатура КАК Номенклатура,
	        |		Серия КАК Серия,
	        |		КоличествоУпаковок КАК КоличествоУпаковок,
	        |		НомерГруппыЗатрат КАК НомерГруппыЗатрат,
	        |		ИдентификаторСтроки КАК ИдентификаторСтроки,
	        |		КодСтроки КАК КодСтроки
	        |	) КАК ВыходныеИзделия,
	        |	ПроизводствоБезЗаказа.ВыходныеИзделияСерии.(
	        |		Ссылка КАК Ссылка,
	        |		НомерСтроки КАК НомерСтроки,
	        |		Серия КАК Серия,
	        |		Номенклатура КАК Номенклатура,
	        |		Характеристика КАК Характеристика,
	        |		Получатель КАК Получатель,
	        |		Назначение КАК Назначение,
	        |		НомерГруппыЗатрат КАК НомерГруппыЗатрат,
	        |		Количество КАК Количество
	        |	) КАК ВыходныеИзделияСерии,
	        |	ПроизводствоБезЗаказа.ПобочныеИзделия.(
	        |		Ссылка КАК Ссылка,
	        |		НомерСтроки КАК НомерСтроки,
	        |		Подразделение КАК Подразделение,
	        |		СтатьяКалькуляции КАК СтатьяКалькуляции,
	        |		КоличествоУпаковок КАК КоличествоУпаковок,
	        |		Характеристика КАК Характеристика,
	        |		НаправлениеВыпуска КАК НаправлениеВыпуска,
	        |		Упаковка КАК Упаковка,
	        |		Серия КАК Серия,
	        |		Цена КАК Цена,
	        |		Номенклатура КАК Номенклатура,
	        |		Количество КАК Количество,
	        |		Назначение КАК Назначение,
	        |		Сумма КАК Сумма,
	        |		Получатель КАК Получатель,
	        |		СтатусУказанияСерий КАК СтатусУказанияСерий,
	        |		ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	        |		АналитикаРасходов КАК АналитикаРасходов,
	        |		АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	        |		НомерГруппыЗатрат КАК НомерГруппыЗатрат,
	        |		АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	        |		ИдентификаторСтроки КАК ИдентификаторСтроки,
	        |		ОформитьОтчетДавальцу КАК ОформитьОтчетДавальцу,
	        |		НастройкаСчетовУчета КАК НастройкаСчетовУчета
	        |	) КАК ПобочныеИзделия,
	        |	ПроизводствоБезЗаказа.ПобочныеИзделияСерии.(
	        |		Ссылка КАК Ссылка,
	        |		НомерСтроки КАК НомерСтроки,
	        |		Серия КАК Серия,
	        |		Номенклатура КАК Номенклатура,
	        |		Получатель КАК Получатель,
	        |		Назначение КАК Назначение,
	        |		НомерГруппыЗатрат КАК НомерГруппыЗатрат,
	        |		Характеристика КАК Характеристика,
	        |		Количество КАК Количество
	        |	) КАК ПобочныеИзделияСерии,
	        |	ПроизводствоБезЗаказа.МатериалыИРаботы.(
	        |		Ссылка КАК Ссылка,
	        |		НомерСтроки КАК НомерСтроки,
	        |		Склад КАК Склад,
	        |		Номенклатура КАК Номенклатура,
	        |		Характеристика КАК Характеристика,
	        |		КоличествоУпаковок КАК КоличествоУпаковок,
	        |		Количество КАК Количество,
	        |		Упаковка КАК Упаковка,
	        |		Назначение КАК Назначение,
	        |		Серия КАК Серия,
	        |		Подразделение КАК Подразделение,
	        |		СтатусУказанияСерий КАК СтатусУказанияСерий,
	        |		СтатьяКалькуляции КАК СтатьяКалькуляции,
	        |		НомерГруппыЗатрат КАК НомерГруппыЗатрат,
	        |		АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	        |		ИдентификаторСтроки КАК ИдентификаторСтроки
	        |	) КАК МатериалыИРаботы,
	        |	ПроизводствоБезЗаказа.Трудозатраты.(
	        |		Ссылка КАК Ссылка,
	        |		НомерСтроки КАК НомерСтроки,
	        |		Подразделение КАК Подразделение,
	        |		ВидРабот КАК ВидРабот,
	        |		Количество КАК Количество,
	        |		СтатьяКалькуляции КАК СтатьяКалькуляции,
	        |		НомерГруппыЗатрат КАК НомерГруппыЗатрат,
	        |		Исполнитель КАК Исполнитель,
	        |		КодСтроки КАК КодСтроки
	        |	) КАК Трудозатраты,
	        |	ПроизводствоБезЗаказа.ДополнительныеРеквизиты.(
	        |		Ссылка КАК Ссылка,
	        |		НомерСтроки КАК НомерСтроки,
	        |		Свойство КАК Свойство,
	        |		Значение КАК Значение,
	        |		ТекстоваяСтрока КАК ТекстоваяСтрока
	        |	) КАК ДополнительныеРеквизиты,
	        |	ПроизводствоБезЗаказа.ВидыЗапасовМатериалыИРаботы.(
	        |		Ссылка КАК Ссылка,
	        |		НомерСтроки КАК НомерСтроки,
	        |		АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	        |		Подразделение КАК Подразделение,
	        |		СтатьяКалькуляции КАК СтатьяКалькуляции,
	        |		ВидЗапасов КАК ВидЗапасов,
	        |		НомерГТД КАК НомерГТД,
	        |		Количество КАК Количество,
	        |		КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	        |		КоличествоУпаковок КАК КоличествоУпаковок,
	        |		Упаковка КАК Упаковка,
	        |		НомерГруппыЗатрат КАК НомерГруппыЗатрат,
	        |		ИдентификаторСтроки КАК ИдентификаторСтроки,
	        |		ВидЗапасовПолучателя КАК ВидЗапасовПолучателя
	        |	) КАК ВидыЗапасовМатериалыИРаботы,
	        |	ПроизводствоБезЗаказа.ВидыЗапасовВыходныеИзделия.(
	        |		Ссылка КАК Ссылка,
	        |		НомерСтроки КАК НомерСтроки,
	        |		АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	        |		ВидЗапасов КАК ВидЗапасов,
	        |		НомерГТД КАК НомерГТД,
	        |		НаправлениеВыпуска КАК НаправлениеВыпуска,
	        |		Получатель КАК Получатель,
	        |		Спецификация КАК Спецификация,
	        |		Подразделение КАК Подразделение,
	        |		АналитикаРасходов КАК АналитикаРасходов,
	        |		АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	        |		ИдентификаторСтроки КАК ИдентификаторСтроки,
	        |		ОформитьОтчетДавальцу КАК ОформитьОтчетДавальцу,
	        |		КодСтроки КАК КодСтроки,
	        |		Количество КАК Количество,
	        |		НомерГруппыЗатрат КАК НомерГруппыЗатрат,
	        |		ДоляСтоимости КАК ДоляСтоимости,
	        |		Сумма КАК Сумма,
	        |		ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	        |		НастройкаСчетовУчета КАК НастройкаСчетовУчета
	        |	) КАК ВидыЗапасовВыходныеИзделия,
	        |	ПроизводствоБезЗаказа.ВидыЗапасовПобочныеИзделия.(
	        |		Ссылка КАК Ссылка,
	        |		НомерСтроки КАК НомерСтроки,
	        |		АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	        |		Получатель КАК Получатель,
	        |		НомерГТД КАК НомерГТД,
	        |		Подразделение КАК Подразделение,
	        |		ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	        |		ВидЗапасов КАК ВидЗапасов,
	        |		АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	        |		СтатьяКалькуляции КАК СтатьяКалькуляции,
	        |		АналитикаРасходов КАК АналитикаРасходов,
	        |		ИдентификаторСтроки КАК ИдентификаторСтроки,
	        |		НаправлениеВыпуска КАК НаправлениеВыпуска,
	        |		ОформитьОтчетДавальцу КАК ОформитьОтчетДавальцу,
	        |		Количество КАК Количество,
	        |		Сумма КАК Сумма,
	        |		НомерГруппыЗатрат КАК НомерГруппыЗатрат,
	        |		ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	        |		НастройкаСчетовУчета КАК НастройкаСчетовУчета
	        |	) КАК ВидыЗапасовПобочныеИзделия,
	        |	ПроизводствоБезЗаказа.МоментВремени КАК МоментВремени,
	        |	СостоянияЭД.СостояниеЭДО КАК СостояниеЭДО,
	        |	СостоянияЭД.ПредставлениеСостояния КАК ПредставлениеСостояния,
	        |	ПроизводствоБезЗаказа.Автор КАК Автор,
	        |	ЗаказКлиента.Ссылка КАК Заказ
	        |ИЗ
	        |	Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭД
	        |		ПО (СостоянияЭД.СсылкаНаОбъект = ПроизводствоБезЗаказа.Ссылка)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	        |		ПО (ПроизводствоБезЗаказа.ИдЗаказаITOkna = ЗаказКлиента.ИдЗаказаITOkna
	        |				И ПроизводствоБезЗаказа.ИдЗаказаITOkna <> 0)";
	
КонецФункции
