
&НаСервере
Процедура IT_Okna_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Попытка
		СписокДокументыПроизводства.ТекстЗапроса = ТекстЗапросаСписка();
		
		НовыйЭлемент  = Элементы.Добавить("СписокДокументыПроизводстваЗаказ", Тип("ПолеФормы"), Элементы.СписокДокументыПроизводства);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
		НовыйЭлемент.ПутьКДанным = "СписокДокументыПроизводства.Заказ";;
	Исключение
	КонецПопытки;
	//Сообщить(СписокДокументыПроизводства.ТекстЗапроса);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекстЗапросаСписка()
	
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ВЫБОР
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.АктВыполненныхВнутреннихРабот
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.АктВыполненныхВнутреннихРабот)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ДвижениеПродукцииИМатериалов)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ПроизводствоБезЗаказа
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ПроизводствоБезЗаказа)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.РаспределениеВозвратныхОтходов
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.РаспределениеВозвратныхОтходов)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.РаспределениеПроизводственныхЗатрат
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.РаспределениеПроизводственныхЗатрат)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.РаспределениеПрочихЗатрат
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.РаспределениеПрочихЗатрат)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ВыработкаСотрудников
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ВыработкаСотрудников)
	        |		КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.Сторно
	        |			ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.Сторно)
	        |	КОНЕЦ КАК Ссылка,
	        |	РеестрДокументовПереопределяемый.Проведен КАК Проведен,
	        |	РеестрДокументовПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	        |	РеестрДокументовПереопределяемый.НомерДокументаИБ КАК Номер,
	        |	РеестрДокументовПереопределяемый.ДатаДокументаИБ КАК Дата,
	        |	РеестрДокументовПереопределяемый.Организация КАК Организация,
	        |	РеестрДокументовПереопределяемый.Подразделение КАК Подразделение,
	        |	ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.МестоХранения.Ключ КАК Справочник.Склады) КАК Склад,
	        |	РеестрДокументовПереопределяемый.Ответственный КАК Менеджер,
	        |	РеестрДокументовПереопределяемый.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	        |	СостоянияЭДПереопределяемый.ПредставлениеСостояния КАК ПредставлениеСостояния,
	        |	РеестрДокументовПереопределяемый.НаправлениеДеятельности КАК НаправлениеДеятельности,
	        |	РеестрДокументовПереопределяемый.Статус КАК Статус,
	        |	РеестрДокументовПереопределяемый.Дополнительно КАК Дополнительно,
	        |	РеестрДокументовПереопределяемый.Комментарий КАК Комментарий,
	        |	РеестрДокументовПереопределяемый.НомерПервичногоДокумента КАК НомерВходящегоДокумента,
	        |	РеестрДокументовПереопределяемый.ДатаПервичногоДокумента КАК ДатаВходящегоДокумента,
	        |	ВЫБОР
	        |		КОГДА РеестрДокументовПереопределяемый.Проведен
	        |			ТОГДА 0
	        |		КОГДА РеестрДокументовПереопределяемый.ПометкаУдаления
	        |			ТОГДА 1
	        |		ИНАЧЕ 2
	        |	КОНЕЦ КАК НестандартнаяКартинка,
	        |	РеестрДокументовПереопределяемый.ДополнительнаяЗапись КАК ДополнительнаяЗапись,
	        |	РеестрДокументовПереопределяемый.ТипСсылки КАК ТипСсылки,
	        |	ЕСТЬNULL(СтатусыПроверки.СтатусПроверки, ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиФинансовыхДокументов.ПустаяСсылка)) КАК СтатусПроверки,
	        |	ТИПЗНАЧЕНИЯ(РеестрДокументовПереопределяемый.Ссылка) КАК ТипЗначения,
	        |	РеестрДокументовПереопределяемый.СторноИсправление КАК СторноИсправление,
	        |	ВЫБОР
	        |		КОГДА НЕ РеестрДокументовПереопределяемый.СторноИсправление
	        |			ТОГДА НЕОПРЕДЕЛЕНО
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА РеестрДокументовПереопределяемый.СторнируемыйДокумент ССЫЛКА Документ.АктВыполненныхВнутреннихРабот
	        |					ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.СторнируемыйДокумент КАК Документ.АктВыполненныхВнутреннихРабот)
	        |				КОГДА РеестрДокументовПереопределяемый.СторнируемыйДокумент ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	        |					ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.СторнируемыйДокумент КАК Документ.ДвижениеПродукцииИМатериалов)
	        |				КОГДА РеестрДокументовПереопределяемый.СторнируемыйДокумент ССЫЛКА Документ.ПроизводствоБезЗаказа
	        |					ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.СторнируемыйДокумент КАК Документ.ПроизводствоБезЗаказа)
	        |				КОГДА РеестрДокументовПереопределяемый.СторнируемыйДокумент ССЫЛКА Документ.РаспределениеВозвратныхОтходов
	        |					ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.СторнируемыйДокумент КАК Документ.РаспределениеВозвратныхОтходов)
	        |			КОНЕЦ
	        |	КОНЕЦ КАК СторнируемыйИсправляемыйДокумент,
	        |	РеестрДокументовПереопределяемый.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	        |	ЕСТЬNULL(ЗаказКлиента.Ссылка, НЕОПРЕДЕЛЕНО) КАК Заказ
	        |ИЗ
	        |	РегистрСведений.РеестрДокументов КАК РеестрДокументовПереопределяемый
	        |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПроверкиДокументов КАК СтатусыПроверки
	        |		ПО РеестрДокументовПереопределяемый.Организация = СтатусыПроверки.Организация
	        |			И РеестрДокументовПереопределяемый.Ссылка = СтатусыПроверки.Документ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭДПереопределяемый
	        |		ПО (СостоянияЭДПереопределяемый.СсылкаНаОбъект = РеестрДокументовПереопределяемый.Ссылка)}
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	        |		ПО (ВЫБОР
	        |				КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ПроизводствоБезЗаказа
	        |					ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ПроизводствоБезЗаказа).ИдЗаказаITOkna = ЗаказКлиента.ИдЗаказаITOkna
	        |							И ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ПроизводствоБезЗаказа).ИдЗаказаITOkna <> 0
	        |				ИНАЧЕ ЛОЖЬ
	        |			КОНЕЦ)
	        |{ГДЕ
	        |	(ВЫБОР
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.АктВыполненныхВнутреннихРабот
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.АктВыполненныхВнутреннихРабот)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ДвижениеПродукцииИМатериалов)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ПроизводствоБезЗаказа
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ПроизводствоБезЗаказа)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.РаспределениеВозвратныхОтходов
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.РаспределениеВозвратныхОтходов)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.РаспределениеПроизводственныхЗатрат
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.РаспределениеПроизводственныхЗатрат)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.РаспределениеПрочихЗатрат
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.РаспределениеПрочихЗатрат)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.ВыработкаСотрудников
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.ВыработкаСотрудников)
	        |			КОГДА РеестрДокументовПереопределяемый.Ссылка ССЫЛКА Документ.Сторно
	        |				ТОГДА ВЫРАЗИТЬ(РеестрДокументовПереопределяемый.Ссылка КАК Документ.Сторно)
	        |		КОНЕЦ).* КАК Ссылка,
	        |	РеестрДокументовПереопределяемый.Организация.* КАК Организация,
	        |	РеестрДокументовПереопределяемый.ДатаДокументаИБ КАК Дата,
	        |	РеестрДокументовПереопределяемый.НомерДокументаИБ КАК Номер,
	        |	РеестрДокументовПереопределяемый.Статус КАК Статус,
	        |	РеестрДокументовПереопределяемый.ТипСсылки КАК ТипСсылки,
	        |	РеестрДокументовПереопределяемый.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	        |	РеестрДокументовПереопределяемый.Подразделение.* КАК Подразделение,
	        |	РеестрДокументовПереопределяемый.Ответственный.* КАК Менеджер,
	        |	РеестрДокументовПереопределяемый.Дополнительно КАК Дополнительно,
	        |	РеестрДокументовПереопределяемый.Комментарий КАК Комментарий,
	        |	РеестрДокументовПереопределяемый.Проведен КАК Проведен,
	        |	РеестрДокументовПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
	        |	(РеестрДокументовПереопределяемый.ДатаДокументаИБ >= &НачалоПериода
	        |			И РеестрДокументовПереопределяемый.ДатаДокументаИБ <= &КонецПериода) КАК Поле2}";
	
	Возврат Текст;
	
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("СписокДокументыПроизводстваВыбор")
Процедура IT_Okna_СписокДокументыПроизводстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОбщегоНазначенияУТКлиент.ИзменитьЭлемент(Элемент);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	Если Поле = Элементы.ПредставлениеСостояния Тогда
		ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаСписка(Элемент.ТекущиеДанные.Ссылка, СтандартнаяОбработка);
	КонецЕсли;
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
    #Вставка
	Если Поле = Элементы["СписокДокументыПроизводстваЗаказ"] Тогда
		ЗаказСсылка = Элемент.ТекущиеДанные.Заказ;
		Если ЗначениеЗаполнено(ЗаказСсылка) Тогда
			ПоказатьЗначение(Неопределено, ЗаказСсылка);
		КонецЕсли;	
	КонецЕсли;
	#КонецВставки
КонецПроцедуры
