
#Область ОписаниеПеременных

&НаКлиенте
Перем  ЗакрытиеРазрешено;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Пользователь", Пользователь);
	Параметры.Свойство("Пароль", Пароль);
	Параметры.Свойство("Каталог", Каталог);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		Если Не ЗакрытиеРазрешено Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытия.Фильтр = "Файл базы(*.gdb)|*.gdb";
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	
	Обработчик = Новый ОписаниеОповещения("ПослеВыбораКаталогаБазы", ЭтотОбъект);
	
	ДиалогОткрытия.Показать(Обработчик);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодтвердитьИЗакрыть(Команда)
	
	ЗакрытиеРазрешено = Истина;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Пользователь", Пользователь);
	ПараметрыЗакрытия.Вставить("Пароль", Пароль);
	ПараметрыЗакрытия.Вставить("Каталог", Каталог);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ЗакрытиеРазрешено = Истина;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

&НаКлиенте
Процедура ПослеВыбораКаталогаБазы(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() Тогда
		Каталог = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

ЗакрытиеРазрешено = Ложь;
