
&НаСервере
Процедура ITS_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Зеленый);
	//
	//ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ITS_Основной");
	//ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементУсловия.ПравоеЗначение = Истина;
	//ЭлементУсловия.Использование = Истина;
	//
	//ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ITS_Основной");
	
КонецПроцедуры
